Revit 2017 API
AssetPropertyDistance Class
 Represents a property of distance value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyDistance : AssetProperty
Visual Basic
Public Class AssetPropertyDistance _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDistance : public AssetProperty
Remarks
 It holds a double value. The unit varies.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyDistance
See Also
AssetPropertyDistance Members
Autodesk.Revit.Utility Namespace